; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph0 - mode
	thermograph3 - mode
	infrared2 - mode
	image1 - mode
	GroundStation1 - direction
	Star3 - direction
	Star12 - direction
	GroundStation11 - direction
	GroundStation5 - direction
	Star4 - direction
	Star14 - direction
	Star0 - direction
	GroundStation8 - direction
	Star6 - direction
	GroundStation13 - direction
	Star2 - direction
	Star10 - direction
	Star7 - direction
	Star9 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 Star6)
	(supports instrument2 image1)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star14)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation13)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
	(supports instrument4 image1)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star10)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation11)
)
(:goal (and
	(pointing satellite1 Star7)
	(have_image Phenomenon15 thermograph3)
	(have_image Planet16 image1)
	(have_image Phenomenon17 thermograph3)
	(have_image Star18 spectrograph0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
2. (calibrate satellite1 instrument2 groundstation8)
   added: (calibrated instrument2)
   goals met: 0 of 5
3. (turn_to satellite1 phenomenon17 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 5
4. (take_image satellite1 phenomenon17 instrument2 thermograph3)
   added: (have_image phenomenon17 thermograph3)
   goals met: 1 of 5
5. (turn_to satellite1 phenomenon15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 5
6. (take_image satellite1 phenomenon15 instrument2 thermograph3)
   added: (have_image phenomenon15 thermograph3)
   goals met: 2 of 5
7. (turn_to satellite1 planet16 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet16)
   goals met: 2 of 5
8. (take_image satellite1 planet16 instrument2 image1)
   added: (have_image planet16 image1)
   goals met: 3 of 5
9. (turn_to satellite1 star18 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star18)
   goals met: 3 of 5
10. (take_image satellite1 star18 instrument2 spectrograph0)
   added: (have_image star18 spectrograph0)
   goals met: 4 of 5
11. (turn_to satellite1 star7 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star7)
   goals met: 5 of 5
